{
  "observational humor": [
    "The mods removed the previous joke that summited about my penis. It was improperly tagged as long.",
    "Imagine if our butt crack was horizontal There would be a clapping sound everytime we go up the stairs",
    "Why do black people spend so much on their shoes? You would to if you had such a long walk home.",
    "What did the leper say to the prostitute after their session? \"Keep the tip.\"",
    "Have you ever seen Ted Cruz and the Zodiac Killer in the same room? Me neither.",
    "[waffle house] Waitress: how do u like your eggs Me: hatched and with their families W: no how do u like them cooked M: [spits out coffee]",
    "You don't need a parachute to go skydiving.. ..You need a parachute to go skydiving twice.",
    "When a guy wearing shorts and sandals to a bar is picking out songs on the jukebox, it's going to end badly for everyone.",
    "Wife online? Kids asleep? Time to relax & unwind with a damp cloth and a bottle of multi-surface cleaner. 'Me time'.",
    "What's the difference between a man biking to a job interview and a clown on a unicycle? Attire.",
    "I read that if you have 2 hangovers a year you are an alcoholic so I'm around 104 alcoholics",
    "My girlfriend hates it when I sneak up on her... According to her lawyer, she also hates it when I call her my girlfriend.",
    "I knew a website with a lot of zelda stuff But I forgot the link.",
    "Australia's got 99 problems... But beaches ain't one.",
    "How many knees could a negro grow if a negro could grow knees?",
    "\"Son, you were adopted.\" \"What, really?\" I said. \"Yes, they're coming to pick you up in an hour\"",
    "Just wrote a musical composition about pedophiles... \"Dick\" in A minor",
    "Our country's going to shit and I will not stand for it... ...so I sat down",
    "I want to die peacefully in my sleep, like my grandfather.... not screaming in terror, like his passengers.",
    "We never knew he was a drunk... until he showed up to work sober.",
    "I spent last night defrosting the fridge. Or \"foreplay\" as she likes to call it.",
    "Yo mama so ugly... ...when she plays Mortal Kombat, Scorpion says \"STAY OVER THERE!\"",
    "What do guns and feminists have in common? They are very loud when triggered.",
    "Why would it suck to be an egg? Because you only get laid once, only get smashed once, and the only chick that sits on your face is your mother",
    "Tony Abbot Nuff' said",
    "Russian family conversation \"Papa, can I have 10 rubl?\" \"20 rubl? Why you need 30 rubl!?\"",
    "What did the Bantha say when he ate the Wookie? Chewie (You have to be a Star Wars fan)",
    "[phone makes noise] [gets giddy about how popular I'm about to feel] Oh. It's an email about car insurance. [quietly dies a little inside]",
    "What I say: Get dressed Brush teeth Get in the car What my kids hear: Have a snack Shriek like monkeys Open 3 umbrellas indoors Go poop",
    "*Looks left* *Looks right* *Crosses road* *Gets run over by chicken*",
    "I asked my wife what would be the best way to get rid of our son's hiccups. She said, \"Stick on your priest costume.\"",
    "Yeah yeah \"Friends with Benefits\" are cool but have you tried \"Friends with Batteries\"? Less drama!",
    "Abacus Just received my new Chinese abacus. It's poorly made. I can't count on it",
    "Are you ready to be disappointed?",
    "What's the difference between a Baptist and a Methodist? A Methodist will say hi when he sees you at the liquor store.",
    "Ironically, I only know of one person with the name Common.",
    "Why couldn't the lifeguard save the hippie from drowning? He was *too far out, maaan*.",
    "Why don't Amish people water ski? Because their horses would drown.",
    "Is my wife dissatisfied with me? A tiny part of me says yes..",
    "How do I like eggs? Ummm...in a cake!",
    "Apparently, Bill Cosby likes his women the way he likes his Jello Pudding... ...passed out cold.",
    "what version of Windows does Jesus use? XP",
    "Two fish were sitting in a tank... One turns to the other and says \"Hey, do you know how to drive this thing?\"",
    "FUN PRANK: tweet \"going hang gliding!!!!\" then don't tweet again for 12 years",
    "If the cure for AIDS could get you high, we'd figure it out in about a week.",
    "What does a ninja use to measure someone's pulse A **stealthoscope**",
    "Do you know how to get a witch pregnant..... You fuck her",
    "My neighbours listen to awesome music. Wether they like it or not!",
    "Chuck Norris can land a plane in Auto Pilot.",
    "Why do women live longer than men? God gives them the time back they spent parking."
  ],
  "dark humor": [
    "You know how some people make food exactly as it appears on the cookbook? I guess you could say they made copy and pasta.",
    "My sister told me to \"take the spider out\" instead of \"kill\" it. So we went and had some drinks. Cool guy. Wants to be a lawyer.",
    "Why does Dr. Pepper come in bottles? Because his wife is dead.",
    "I hate when a grocery clerk judges you for what you put on the checkout belt. I found that dead cat behind YOUR store & now I want to buy it",
    "(NSFW) They've finally published my self-help book about having sex with herbs It's about fucking thyme.",
    "How do snails get their shells all shiny? They use snail polish.",
    "A man was arrested standing next to his homie coz it was homie side",
    "The rain is starting to worry me. I'm afraid that because I have a beard that my friends will expect me to build an ark.",
    "These ramen noodles taste like payday is next Friday.",
    "What is a Mexican with a rubber toe called Roberto",
    "Yo mama is so Black that she went to the funeral naked!",
    "How many pallbearers are needed at an Indian funeral? 2, it only takes two people to carry a trash-can.",
    "My ex GF turned out to be anorexic. Gradually I just saw less and less of her.",
    "Ed Hardy makes a wine. Just tasted some. With full-bodied undertones of asshat, its repugnant mouthfeel would pair well with a cheeseball.",
    "What anime do Mexicans watch? Boku no Pico de Gallo",
    "My girlfriend's dog died so to cheer her up I went out and got her an identical one. She was livid. \"What am I going to do with two dead dogs?\"",
    "ME: Hey they're playing our song. HER: This isn't our song. ME: [turning up \"Go Your Own Way\"] Yes it is, Karen. I want a divorce.",
    "Why did Bernie Sanders cross the road? He didn't, he was distributed evenly on both sides. Bernie supporters, please don't downvote me to hell, it's just a joke",
    "Bird pokemon must live in mexico because today a local pointed at me and said pinche joto. (The j has an h sound dummy)",
    "I'd like to commit suicide to get rid of my indecisiveness but I don't wanna jump into conclusions.",
    "What does Mario use to talk to dead people? A Luigi Board",
    "Psyched for the new Rihanna/Chris Brown songs! Haven't been this excited since Hitler & Anne Frank's duet, \"Chillax, Haterz!\"",
    "What did the suicide bomber say when he saw a naked girl for the first time? Nothing. He just exploded.",
    "Nana's house is getting real bad, you can't swing a dead cat without hitting another dead cat.",
    "Who should we vote for the next president? Gabe Newell. There will never be a World War 3.",
    "You seriously don't want hear my next Fibonacci joke. It's as bad as the previous two combined.",
    "My grandad gave me some sound advice on his deathbed. \"It's worth spending money on good speakers,\" he told me.",
    "What did the judge say to the repeat sex offender at his arraignment? [Damn, Daniel - back at it again with the white van.](http://therealcape.com/wp-content/uploads/2015/06/white-van-png.jpg)",
    "What does Harry Potter say after he purchases slaves? I expect to Potter-own 'em.",
    "Next time at a public swimming pool just stop, look around & ask yourself: \"Is there anyone here that I would want to take a bath with?\"",
    "What was the first thing Hellen Keller noticed at the beach? The volleyball net.",
    "What makes football players bi-sexual? They play with Cleats and Balls all day.",
    "Girlfriend Pissing You Off? Text her \"He's busy\" and turn your phone off.",
    "If there's another explanation for my gray hairs other than I'm turning into a polar bear, I don't want to hear it. Don't ruin this for me.",
    "Did you hear Woody stabbed his best friend? What a Buzz kill",
    "What is the difference between straight and bisexual? A 6 pack and a backrub",
    "Didn't u hate it when as a kid u got the \"mystery flavor\" lollipop & the mystery ended up being that your parents got divorced (Or lemon)?",
    "It's hard not to bring up the fact I'm vegan whenever people talk about food or a new restaurant or that their mom just died or",
    "Homosexual Relationships (Pun) gay guys talking about relationships some of them say that the person they lost their virginity to were assholes I comment \"I think you all lost it to assholes tbh\"",
    "Why does internet explorer ask so many questions? Because it's insecure. It has trust issues.",
    "What internet provider does Satan use in hell? Comcast",
    "Why do they hand out Kleenex at funerals if you're not supposed to jerk off in the back row",
    "What do you call two mexicans playing tennis? Juan on Juan.",
    "Do you know what a sex stone is? It's just a fucking rock.",
    "Siamese Cat My girlfriend wanted me to buy her a Siamese cat. My mate told me that they are really expensive, so I've bought 2 normal cats and glued their heads together.",
    "Father: You were absent on the day of the test? Son: No but the boy who sits next to me was!",
    "Why are tamales a Christmas tradition? So Mexicans have something to open on Christmas",
    "If some last names were an ancestor's profession (Baker, Cobbler) How do you explain Dickinson?",
    "What did the devil get arrested for? Possession!",
    "my parents did a terrible job of distributing my skill points"
  ],
  "wordplay and puns": [
    "If the pen is mightier than the sword... ... Then why do actions speak louder than words?",
    "What do you call a cookie without legs? A cookie",
    "What do you call Captain Forte and his sidekick Piano? A dynamic duo! This joke came to me in my delirious state after hours of band camp practices.",
    "What do you call an Asian in a tank? A chink in the armor.",
    "Why didn't the man report his stolen credit card? The thief was spending less than his wife.",
    "Why did the stoplight turn red? Well, wouldn't you turn red if you were caught changing in the middle of the street?",
    "All parents should give corporal punishment to their kids. You don't want the white kid to feel left out at school, when everyone is telling the ass whooping they got last night.",
    "What do you call a Roman fighter with curly hair in his teeth? Gladiator. (Glad he ate her)",
    "Knock knock.... (Who's there?) Ellen Pao's Resume.",
    "Why did the mission control operator tell the astronauts not to eat any food? She saw some off-nom telemetry.",
    "What do you call a bird that speaks Spanish? A Si-gull",
    "Police Chief: Why did you ticket the computer? Officer: It was speeding along the information highway.",
    "What do you call Oprah on drugs? Doprah",
    "A giraffe walks into a bar, orders 6 martinis ...and shame on you for wanting a punchline. This giraffe needs help.",
    "Why did the stutterer get shot in the ghetto? He was asking for directions for the \"k-k-k-mart.\"",
    "Why did the guitarist go to prison? For fingering a minor.",
    "What do you call it when a male mathematician imagines himself having an orgasm? Squirt(-1).",
    "Why did the hipster drown? He went ice Skating before it was cool",
    "Why did Bruce Jenner crash his car? Because she's a woman.",
    "I heard a great Ray Rice joke... but I can't remember the punchline.",
    "What do you call a terrorist cowboy? A jiiiiiihadist. Not sorry.",
    "How did Canada name their country? They picked random letters from a hat. C, eh? N, eh? D, eh?",
    "what do you call a bookstore that's also a bar? tequila mockingbird",
    "Why did the nutty kid throw butter out of  the window? He wanted to see a butterfly.",
    "What do you call a man without shins? Tony. (A joke created by a non-redditing friend)",
    "Why did the baker have brown hands? He kneaded a pooh",
    "Why did the scarecrow get a promotion? He was out-standing in his field",
    "If you punch a hippie, and a cop arrests you... Would you get arrested for disturbing the peace?",
    "Why did the feminist get fired from Panera? Because she ate all the cookies and didn't know how to make a sandwich.",
    "what do you call a retarded person who crapped their pants down in the dump.",
    "bloke in the pub The other night, this bloke in the pub was telling me he was a big star in the 80's with a song called \"stand and deliver\". I didn't believe a word he said, but he was adamant",
    "Why did the dung beetle go to rehab? He was rolling balls.",
    "Lady and the Tramp spaghetti scene except it's me throat punching you for trying to eat my food.",
    "Confusing the word, \"jacuzzi\" with, \"yakuza\" has gotten me in hot water with the Japanese mafia more than once.",
    "What do you call a sheep covered in chocolate? A candy baa",
    "Why did the bald man go outside ? To get some fresh hair !",
    "Entered a competition with 10 of my best puns thinking at least one would win.... No pun in ten did. Sorry if thats been said. It's just my favorite pun and I thought I'd share it.",
    "Why did Johnny Bravo go to the pet store? To pick up some chicks.",
    "Why did the vampire have pedestrian eyes?  They looked both ways before they crossed.",
    "What do you call an atheist in a six foot pine box? All dressed up, with no place to go.",
    "I'll never understand why the guy that invented braille didn't just put the dots in shape of the actual letters.",
    "What do you call an Italian hooker? A pastatute!",
    "Why did the chemist never say \"NO\" to anything? Because the reaction could be explosive.",
    "knock knock who's it? omelet. omelet who? am late, open the door.",
    "What do you call a cow with 2 legs. YOUR MOM!",
    "My bf just asked me \"what do you call it when you get water sprayed up your butt to clean it, again?\" Me \"...foreplay\"",
    "Knock Knock Knock, knock. Who's there? Anee. Anee,who? Anee one you like!",
    "What do you call a Jamaican cooking competition? A jerkoff",
    "\"\"Dammit I'm Mad\" is spelled the same way backwards. Think about it.\"",
    "An open letter to the President of the United States. Dear Mr. President I know where you live."
  ],
  "absurd and surreal humor": [
    "Someday future archaeologists are going to dig up Disney World and think it was some bizarre mouse-worshiping kingdom.",
    "Black magic is just like regular magic, but with bigger wands.",
    "How many surrealists does it take to screw in a lightbulb? Fish.",
    "*wants space* *eats Milky Way*",
    "What is hitlers favorite yugio card? The blue eyes white dragon",
    "Thanks to twitter the approval of family and friends has taken a backseat to the approval of strangers on the Internet.",
    "\"Shrooms before brooms,\" I say to the coven of stereotypical witches who have quite magically appeared in my living room.",
    "The pope secretly came to my house. He thought it was weird that I had so many Blu-rays still in the shrink wrap. I'll get around to them!",
    "What did the guitarist say to the magician... Pick a chord, any chord.",
    "How do you get dragon milk? A cow with short legs",
    "[1773] \"Your majesty, last night some angry colonists dumped our tea into the Boston Harbor\" *three English ladies faint* WTF THIS MEANS WAR",
    "\"I see an Irish man walking...\" Short I see an Irish man walking with only one shoe on. I tell him \"You're only wearing one shoe, you stupid cunt\". The Irish man replies \"No, I found one.\"",
    "I thought I defeated this dragon, but he's been following me around... I beat him off with a sword",
    "Remember when AOL was the shit? Then it sucked. Myspace was the shit. Then sucked. Facebook was the shit. Then sucked. Twitter is the shit!",
    "I was watching some porn with a plot the other day It was pretty Fucking stupid",
    "Which country has many spaces to put your car in? Park-istan!",
    "A friend confided in me about a peculiar birthmark on his butt. I told his secret to my friends for a laugh. I am Julian AssStrange.",
    "So I just watched a documentary about a blind magician porn star... He was a master of missed erections.",
    "Only three things are infinite The universe, human stupidity, and the winrar trial period.",
    "humans bury seeds in the earth, while birds cut out the middle man and eat them straight. really makes you think if you're stupid like i am",
    "Depression starts in a part of the brain called the Hippocampus Which is strange because I always thought hippos loved studying.",
    "Him: I wonder if this dealership is open. Me: Are you stupid? The parking lot is full.",
    "Where do otters come from? Otter space. [credit goes to Anne Carson, or wherever she heard it]",
    "Wrestling is so stupid..... .....Men with no pants fighting for a belt",
    "Channing Tatum's next movie... Magic Mike - Big &amp; Tall",
    "Why are thousands of kittens dying everyday? For some sick, strange reason, men enjoy smashing pussy.",
    "Why was the Dragonborn arrested in the Whiterun bakery? Dough fucking.",
    "I have this strange feeling that the current VP of the USA is going to do something ridiculous to Pence But he is just Biden his time",
    "9 out of 10 Americans are stupid... I'm so glad I'm in the 1%.",
    "How do you organize a Space Party? You Planet!",
    "My wife keeps complaining about her nine to five job... I must admit, 4:51 is a strange time to start work.",
    "Pulitzer Prize-winner Lois Lane, I want you to meet your new reporting partner, this mysterious stranger who has never held a job before.",
    "FRIEND WHO JUST RECEIVED MAGICAL POWERS: idk what I should do first FRIEND WHO IS TRAPPED IN AN OIL PAINTING FOR SOME REASON: I have an idea",
    "An app that detects itself running on other people's phones, then both devices play Random Encounter music. What happens next is up to you.",
    "On the internet you can be whoever you want. Its odd that so many choose to be stupid.",
    "After being diagnosed with a multiple personality disorder, I phoned my boss to tell him I'd need time off. \"You're self-employed you stupid bastard,\" I said.",
    "You'd be surprised how many strangers will let you hug them when you approach with open arms & a big smile. None. I've been stabbed 3 times",
    "Why is Mike Pence magic? He can turn fruits to vegetables",
    "SMS codes for seniors: BTW - Bring the Wheelchair FWIW - Forgot Where I Was LMDO - Laughing My Dentures Out WTFA - Wet the Furniture Again",
    "I need a backspace key for my mouth",
    "I keep a picture of a dragon fighting a helicopter in my wallet, in case the police ask to see my license for awesome.",
    "yo mama joke I got a yo mama joke thats almost as stupid and ugly as yo mama",
    "when the character's name is the same as the actor's name I assume it's because the actor was too stupid to respond to his character's name",
    "I'm reading a book about anti-gravity... ... It's impossible to put down",
    "Chinese magican Did you hear about the Chinese Magican who did magic with Chocolate? I heard he had loads of Twix up his sleeve.",
    "What's the difference between... A gold fish and a mountain goat? One mucks about the mountain. What's the difference between a police batton and a magician's wand? One is used for cunning stunts.",
    "I see dead people. Well technically they're stupid people, but give me a few minutes.",
    "What do you call the space between a Mormon's butthole and balls? a Latter-day taint!",
    "why do sandwich fillings look weird ? Cos they're in bread",
    "It feels like Robert De Niro just walks onto random film sets and says \"I'm in this now.\""
  ]
}